// 2. Создать кнопку старт в js
// 2.1 Дать кнопке текст
// 2.1 Дать кнопке стиль
//  3 Закинуть кнопку в боди
//  3.1 Определить боди в переменной,
//  4. Создать и добавить в ДОМ div для элементов которые будут появляться при нажатии кнопки START GAME
// 4.1 Дать класс диву
// 4.2 Дать диву свойство display.none, ширина высота и бэкграунд колор
// 5. Повесить на кнопку START GAME  функцию показывать див по клику
//  6. Создать и добавить в divHidden: 4 инпута
// 6.1 Вставляем в див
// 6.2 Создать кнопку для очистки инпутов
// 6.3 Вложить кнопку в див
// 6.4 Создать текст кнопки
// 6.5 Дать свойства кнопке
//  6.6 Повесить на кнопку функцию очистки инпута
// 7. Создать кнопку генератор чисел
// 7.1 Вложить кнопку в див
// 7.2 Создать текст кнопки
// 7.3 Дать свойства кнопке
// 7.4 Повесить функцию генерации числа
// 7.5 Создать функцию генерирующую число
// 8. Создаем кнопку CHECK
// 8.1 Помещаем в див
// 8.2 Создать текст кнопки
// 8.3 Дать свойства кнопке
// 9. Получаем введенные значения из инпута, вешаем обработку событий на кнопку checkBtn
// 10. Создать функцию для проверки номеров по каждой позиции и вцелом в масиве
// 10. 1 Выводим в параграф результат
// 10.1 Также вешаем функцию проверки номеров по клику на кнопку checkBtn
